Autodesk.Revit.DB.ACADVersion
An enumerated type listing available AutoCAD versions, into which a file may be exported.

Autodesk.Revit.DB.ACADVersion.R2018
AutoCAD 2018 file format.

Autodesk.Revit.DB.ACADVersion.R2013
AutoCAD 2013 file format.

Autodesk.Revit.DB.ACADVersion.R2010
AutoCAD 2010 file format.

Autodesk.Revit.DB.ACADVersion.R2007
AutoCAD 2007 file format.

Autodesk.Revit.DB.ACADVersion.Default
The Autodesk Revit application's default export format.